{"query_id": "763", "query": "Rare, surreal, dystopian film with experimental style, possibly Russian, from the 1960s or 1970s, featuring wide shots of a winter wilderness, strange color saturation, and unusual costumes. Extremely rare, with only one partial print available, and not found in \"best weird movies\" lists. Similar to Stalker, el Topo, Holy Mountain, Alphaville, and Delicatessen, but with a unique blend of Kurosawa, Tarkovsky, and Lynch's styles. A true cult classic, possibly with only a handful of fans."}
{"query_id": "802", "query": "\"Caucasian male little person falls in love with a red-haired woman, possibly a childhood friend, in a romance drama where he faces prejudice and loneliness, with a final scene featuring a balcony or rooftop dance in white dresses, possibly at their wedding.\""}
{"query_id": "950", "query": "\"Movie from around 1999, in color, English language, featuring two teenage/early 20s girls who commit a brutal murder, have sex on a bloodied bed, and engage in other transgressive acts, including a shower sex scene and breaking into an elderly woman's trailer home.\""}
{"query_id": "220", "query": "Woman in labor with arms and legs tied, young woman dreaming of birthing a child or creature, small creature entering through belly button, young woman on an altar shaped like a cross, and scenes of labor and dream sequences involving birth or creatures."}
{"query_id": "792", "query": "Little white boy breaks into houses, robs, brags, gets caught, sets apartment on fire, mother works."}
{"query_id": "903", "query": "\"Man in hotel involved in Mafia, receives visits from two men with a bag, interacts with a woman at a cafe, is a silent character with some dialogue, and was released before 2013 in a dubbed version.\""}
{"query_id": "320", "query": "Man gets split in half by an unseen force in a dark scene with a nude woman, in a color movie, around 6-7 years ago, with unknown actors."}
{"query_id": "731", "query": "\"Sci-fi movie from the mid 80s featuring a scientist/robotics engineer who escapes a lab, discovers his girlfriend is a robot clone, flees to a rural farm with his family, only to find they are all humanoid robots, and ultimately, the robot son is electrocuted while operating a front-end loader.\""}
{"query_id": "882", "query": "\"Comedy film from the 80s or 90s featuring two adventurers in an Indiana Jones-like setting, captured by enemy forces, with a villain who says 'gentlemen, we meet again' in a humorous way, and the protagonists react with amusement.\""}
{"query_id": "293", "query": "Romantic comedy movie from at least 10 years ago featuring a first date at a burger stand where the male character expresses anxiety about getting a kiss and the female character initiates a kiss, or suggests they kiss to avoid awkwardness."}
{"query_id": "525", "query": "\"Indie film about a 5-year-old relationship between a couple with a cat, starring Annie Clark, where they discuss feeling stagnant and an older woman shares her perspective that 5 years is just the beginning.\""}
{"query_id": "155", "query": "A 1980s Japanese animated film about a boy who can transform into a robot, with a red mask and a blue suit, fighting against a villain named Dr. Light, featuring a giant metal robot guarding a hill with a cave behind or underneath the machine, containing a white flower growing on a small hill in the center of the cave."}
{"query_id": "1014", "query": "Hong Kong crime/thriller film from the 80s or 90s featuring a woman impersonating a nurse to kidnap and kill a hospitalized person, with scenes of the nurse being tied up and struggling in her underwear, and men in suits standing in the hallway outside the hospital room."}
{"query_id": "784", "query": "English movie from the 2000s featuring a scene where two masked men follow, capture, and assault a woman near a train bridge. One of the men removes his mask, and the other says \"Let her go\" after acknowledging she saw his face. The scene involves a car, a gun, and a train passing overhead. The woman is raped by one of the men. The movie is in English and is from the 2000s."}
{"query_id": "115", "query": "English Netflix movie from the last 3 years with a dark, Tim Burton-esque atmosphere, set in a seaside inn or boardinghouse where residents suffer from poor health due to bad food, but improve when they eat better, possibly with a scene involving a boat at the end of a pier, directed by a style similar to Tim Burton."}
{"query_id": "204", "query": "Teen romance film from around 2006, featuring a boy with unrequited love for a girl with blonde hair and purple attire, including scenes of karate practice, a boy imagining attacking another boy, and a dance scene at a family event without dialogue. The title may contain a number or the letter Q. The boy and girl are friends, and the boy has feelings for her, but she's moving on. The film could be classified as a coming-of-age story.  (Note: The summarized query is a rewritten version of the original queries, preserving the maximum non-redundant information.)"}
{"query_id": "1015", "query": "90s comedy movie featuring a hillbilly family running a haunted inn, with a cane-using elderly man and a well-known actor. The movie is set in a strange, raggedy-looking house with parked cars in front, where the family taunts their guests."}
{"query_id": "758", "query": "\"Old thriller movie (1950s-60s) featuring a young woman with dark hair in an antique shop, looking out the window at two girls (blond or dark-haired) jumping rope and chanting a nursery rhyme, creating a creepy atmosphere, with another woman running the shop. The woman expresses fear or horror about the children. The movie is likely in black and white and may have been seen around 10 years ago.\""}
{"query_id": "880", "query": "Hotel elevator with angels arriving from heaven, black and white movie, featuring long waits in the lobby and frequent elevator status changes."}
{"query_id": "838", "query": "\"Comedy film from the 70s-90s featuring a young man meeting a woman at a café, with a roommate doing paper mache. The story involves theft, confrontation, death, and a scene where the main character is forcibly shaved at a Hard Rock bar or disco.\""}
{"query_id": "246", "query": "1950s black and white suburban drama featuring a Charles Bronson lookalike, portraying an angry man from a diverse socioeconomic neighborhood, whose death resolves the conflict and leaves his family in a mixed state of relief and concern, as he was the breadwinner."}
{"query_id": "909", "query": "\"Murder mystery movie from the 1980s where a younger cousin kills an older cousin after discovering them kissing someone, resulting in a disturbing ending with a stabbing in an alley.\""}
{"query_id": "942", "query": "Movie with actor undergoing transformation, pointing to nose to express love to wife, who is aware of his true self post-transformation, and communicates with him through gestures, specifically pointing finger to nose."}
{"query_id": "588", "query": "IFC film from the early 2000s about a father and daughter living in a desert or Texas house, where the daughter wears a dirty white dress and the father struggles with addiction, mentioning scuba diving, and there's a deceased female relative in the house."}
{"query_id": "520", "query": "army reservist neighbor"}
{"query_id": "484", "query": "American comedy movie (1990-2014) featuring a famous character staying with a married couple, where the husband discovers his wife cheating with the celebrity, leading to a humorous situation. The husband's reaction is one of excitement and acceptance."}
{"query_id": "119", "query": "A sci-fi movie featuring 3-4 astronauts, where one orbits a planet while others land to collect data from probes. The surface crew faces a time crunch due to a storm and a time difference between surface and orbital time, resulting in a significant time gap for the astronaut in orbit. The crew leader, possibly a female, insists on completing the data collection despite warnings, leading to a missed return window. The movie is an American, English-language film, likely released within the last decade.  (Note: I've kept the original query's details and clues, while condensing and rephrasing it to make it more concise"}
{"query_id": "631", "query": "A woman attempts to jump through a passageway in a post-apocalyptic, futuristic society but loses her legs due to a mechanical failure in a machine with robotic arms."}
{"query_id": "437", "query": "English-language color film from the 1970s, featuring a young man driving a bus or caravan in a foreign countryside, meeting a gypsy girl who misinterprets his intentions, leading to a comedic misunderstanding involving her family, with singing involved."}
{"query_id": "742", "query": "\"Movie featuring a teenager and his father, where the father is controlled by an antagonist wearing a special outfit, and the main character uses a high-tech strength-enhancing backpack to cycle at high speeds on an interstate, with the backpack also having the ability to alter voice and allow mind control.\""}
{"query_id": "1048", "query": "\"Movie about a singer who encounters the ghost of Meg Ryan, discovers a selfie with her, and finds herself alone in the photo.\""}
{"query_id": "699", "query": "\"Older musician from England/Ireland returns to South Africa/England/Ireland for childhood friend's funeral, recalling memories of a small band, an affair with an older woman, a home on the shore, a child killed by a bomb, and a costumed dance with his girlfriend.\""}
{"query_id": "635", "query": "\"Movie from the early 1980s featuring a long scary scene of skeletons walking underwater towards land.\""}
{"query_id": "680", "query": "Color, non-verbal, short film or opening scene from the last 2 years, featuring a pregnant cave woman who gives birth alone, wanders, eats raw eggs to breastfeed, hides her baby in a tree, and fights off a predator to protect it, possibly dying at the end."}
{"query_id": "734", "query": "\"Film about a girl who pays tribute to her deceased mother in a crocodile-infested lake, discovers her mother is alive, has a rival from college claiming to be her step-sister, and receives a low salary. The plot involves a dramatic twist where the girl and her mother throw her father out of a plane or helicopter at the end.\""}
{"query_id": "727", "query": "A boy's town and mother are captured by colorful hyenas. He embarks on a journey to find a wizard, who turns out to be a little girl, and meets a wolf that transforms into a human, a pink bunny-like creature, and a character with a mosquito on his shoulder. The boy receives a mirror from the wizard and discovers he has the power to defeat the hyenas. The story features a tribe that worships the pink creature and a character with a mosquito living on his shoulder. The boy's quest is to defeat the hyenas and rescue his mother."}
{"query_id": "910", "query": "\"TV show/movie from 2008-2011, aired on Nickelodeon, Disney Channel, or Cartoon Network, featuring alien-like creatures that steal people, wrap them in a gooey cocoon, and are found via underground piping, with a boy being taken.\""}
{"query_id": "354", "query": "1970s or early 1980s English-language color sci-fi/horror film set on Earth featuring slow-moving, flat, stingray-like creatures with a single vertical stalk for sensing (no eyes) and an alien appearance, moving without visible legs.  (Note: I have preserved the most distinctive features of each query, and removed the redundant information.)"}
{"query_id": "1060", "query": "Teen siblings and a suave guy escape a dystopian future on flying boards, joined by a bodyguard, and later rescue the sister from a facility where she outsmarts her captors. The movie is an adventure-fantasy film in color, in English, released on a kids channel in the mid to late nineties. The final scene shows the kids enjoying freedom on a beach. A character sacrifices themselves for the others, and the sister escapes capture by manipulating a gurney. The movie features a desert chase and a suave guy who narrates."}
{"query_id": "584", "query": "A 90s/early 2000s movie about a boy kidnapped by twin henchmen and taken to a children's colony/prison island, where he is forced to work under a ruthless luchador-like villain. The villain is possibly the object of one of the henchmen's infatuation. The movie features a musical number with the lyrics \"He's so b-b-beautiful to me\" and possibly goo-pods. The film's tone is likely a mix of horror and comedy, and it is likely a cult classic. The henchmen are homely-looking. The movie may involve swamp boat travel"}
{"query_id": "597", "query": "Horror movie set in a funerary house with a chapel-like room on the ground floor and a basement where bodies are prepared for a funeral. The main antagonist is a tall, pale man in a suit and hat who injects a white-yellowish liquid into a dead body and then licks it. The liquid plays a significant role in the plot. The movie is likely from the 1970s or 1980s."}
{"query_id": "971", "query": "\"Cate Blanchett in a love story movie set in a decaying mansion, where she lives with her aunt, and falls in love with a young boy who is the gardener, while her aunt warns about the dangers of a broken heart.\""}
{"query_id": "347", "query": "English-language movie from the 80s or 90s about a teenage girl sent to a horse farm after getting into trouble, where she bonds with a horse, has a tragic accident, and recovers from paralysis."}
{"query_id": "397", "query": "\"English film from 2000-2010 featuring two teenagers (one boy, one girl) working at a waterpark or theme park, becoming friends, involving the girl's younger sister, and including a kiss scene between the boy and the sister.\""}
{"query_id": "199", "query": "Late 70s or 80s action movie with masked hunters, featuring a protagonist hunting them back in a swampy area, culminating in a final confrontation at a glass-heavy house on stilts, possibly involving a helicopter escape, with elements of Surviving the Game and Gymkata, and a \"man hunt\" or \"hunt for sport\" theme."}
{"query_id": "135", "query": "\"Lifetime movie from 2000-2015 about a wealthy businessman who marries a young real estate woman, builds a mansion in England, has an affair with a construction worker, and attempts to kill his wife, based on a true story, involving a flower-related conflict and two children.\""}
{"query_id": "705", "query": "\"Indie film on FLIX in 1997 featuring a gay protagonist in prison with a Spanish-accented inmate, reminiscing about a waiter he had a crush on, who was married with children, and helping the inmate with diarrhea.\""}
{"query_id": "147", "query": "\"1980s western thriller about cowboys finding strange markings on their horses after a wagon crash in a wooded valley.\""}
{"query_id": "235", "query": "Teenagers get sucked into a prehistoric video game with humanoid dinosaurs, where a villain threatens to throw them into a lava or fire pit, and they eventually escape. The movie is a family-friendly sci-fi film released in the late 80's or early 90's, before 1997."}
{"query_id": "576", "query": "\"English-language, color movie from the 1990s about two sisters, one good and one evil, featuring magic, knights, kings, a desert scene with a woman offering a single drop of water, and a scene of them growing up in competition.\""}
{"query_id": "440", "query": "Classic movie (50s or 60s) about sailors who write letters to themselves before parting ways, then reunite 20-25 years later in a bar.  #classicmovies #sailors #bar #letters #20years #classicfilm #movie #film #cinema"}
{"query_id": "551", "query": "\"1960s film featuring a city-dweller vs rednecks, with a karate fight and a scene where the rednecks tow a man on a board down a slope and crash him into a barbed wire fence.\""}
{"query_id": "418", "query": "Two college students crash in a haunted, snowy location after an accident, experience paranormal activities, and develop romantic feelings. The boy has a hidden injury, and they repeatedly attempt to escape, but the boy dies, and the girl survives. The movie was released in 2009 or earlier."}
{"query_id": "949", "query": "\"Foreign movie where a child finds an alien/creature that grants wishes, has a scene where the child swims extremely fast due to the creature's power, and a scene where the creature helps the child cheat on a test by obtaining answers from another student, but the name transfer causes the teacher to reject the answers.\""}
{"query_id": "326", "query": "\"Movie about a young man who wears a distinctive knit cap, meets a girl who considers selling her eggs due to financial need, and exchanges hats, with an epilogue and a color release within the last ten years.\""}
{"query_id": "337", "query": "\"British black-and-white crime film from the late 1950s or early 1960s, featuring a ringleader sending out a half-banknote to criminals with a letter about a rendezvous and potential cash stash or robbery, possibly directed by Jack Warner.\""}
{"query_id": "818", "query": "\"Movie from the 80's or 90's about a widow's dog that gets lost, encounters a truck driver, has various adventures, and returns home before the owner moves away.\""}
{"query_id": "1021", "query": "\"Late 80s or 90s English-language thriller movie set in a color film, featuring a young man being pursued by a middle-aged man in an SUV in an empty underground parking lot.\""}
{"query_id": "187", "query": "\"80s or 90s stoner comedy movie featuring two stoners trapped in a white maze with Easter Bunny, weird grandma, and grim reaper.\""}
{"query_id": "589", "query": "German, Dutch, or Flemish foreign film (2015-2020) about a bearded, dirty, nearly naked man who moves into a family's home and dominates their lives, possibly a mythical creature, with a title consisting of a single word. The film is from the last 5 years and the man/creature is silent and homeless-looking."}
{"query_id": "747", "query": "\"1950s or 1960s black and white horror film featuring a group of people in a house discussing a vengeful relative, with a scene of a decapitated head on a silver tray, possibly titled 'Uncle/Father's Revenge'.\""}
{"query_id": "322", "query": "\"Movie from 1990s-2000s featuring a man accidentally damaging the Mona Lisa with blue paint while trying to fix it, then frantically transporting the covered painting in a cart down a hallway.\""}
{"query_id": "937", "query": "\"1960s-1970s sci-fi TV show featuring a hippie character who uses a tube-like laser gun that impregnates his palm with a gem or scab-like implant, causing him to lose his humanity and transform into an alien after he becomes stuck with his forearm in the gun, and blasts objects like telephone poles.\""}
{"query_id": "335", "query": "English-language movie from the 1990s featuring a family plane crash, a man being placed in a metal cage and set on fire, and a scene of disgusting food (eyes in soup) in color footage."}
{"query_id": "408", "query": "Horror movie opening scene: disfigured girl in a red hoodie enters a small, dimly lit, black and white/gray-toned restaurant, causing discomfort among patrons, who react negatively to her appearance. She removes the hoodie to reveal her disfigured face and yells before the opening credits roll."}
{"query_id": "925", "query": "Movie from 2000-2014, set in a hotel or dormitory with a constant party in the hallway, featuring a support group where young people discuss suicide and murder, with a plot involving a young couple, a girl in a white room, and a climactic murder in the support group room. Starring Kirsten Dunst or a similar blonde actress, possibly a Disney actress. Themes include suicide and murder, and the characters are connected through attempts to convince others to commit these acts. Aired on FOX TV network in the U.S. in 2014."}
{"query_id": "489", "query": "Comedy movie from around 2000 featuring an old man who won the lottery, living in an apartment, where his neighbors try to get his money by waiting for him to die. A new female neighbor moves in, discovers he's dead, and plans to take his money but faces opposition. They eventually team up to escape and get married after obtaining the lottery winnings."}
{"query_id": "239", "query": "\"Early 90s English-language color fantasy film, possibly a feature film, about a young boy (8-10) left alone in a burnt-out house after a fire, with firefighters in full gear ignoring him, in a somber/sad tone, similar to Jim Henson's Dark Crystal or Labyrinth, with a family likely deceased or absent.\""}
{"query_id": "607", "query": "Man held hostage by a woman and possibly her sibling or lover in a 90s American crime film, seen together in a hot tub, with a romantic connection between the hostage and his captor, viewed over 10 years ago."}
{"query_id": "1079", "query": "\"1960s or 1970s foreign film (French or Italian), color, glamorous crime/detective couple, tattoo scenes, phone call while in bed, woman draws dress straps on herself with tattoo pencil, possibly naked, man outside window.\""}
{"query_id": "406", "query": "\"Female psychic teleports to Earth from an enlightened planet where inhabitants live freely, finding it strange. She makes three men dance wildly to music on a grassy hillside. The movie is possibly French, from the late 80's or early 90's, with a culture shock theme.\""}
{"query_id": "614", "query": "\"80s movie or TV show featuring a Vietnamese refugee girl losing a ring down a bathroom sink, which is retrieved by an older American man, with the help of an American couple.\""}
{"query_id": "707", "query": "\"Black and white English TV show or movie from the late 80s featuring a priest drowning a boy in a non-modern bathroom with rough wood plank floors and a tub with feet, with a watch and rosary involved in the scene, and the rosary later found in a septic tank.\""}
{"query_id": "343", "query": "\"Late 60s/early 70s horror/gore exploitation film featuring young women at a remote home, with scenes of severed heads in a refrigerator, cannibalism, and a human foot in a soup pot, possibly ending with the final survivor making soup out of the cannibal family members.\""}
{"query_id": "474", "query": "\"Science fiction film from 80s or 90s featuring a hermaphroditic alien with dual-voiced dialogue, in color and English.\""}
{"query_id": "278", "query": "\"Black and white Western film from 1976-79 featuring a corpulent black-bearded cowboy and a girl, possibly his daughter or an orphan, making pancakes that stick to the ceiling, excluding 'The Paper Moon' by Peter Bogdanovich.\""}
{"query_id": "113", "query": "\"English-language movie set in France's countryside, featuring a man, a woman, an American character, and two chimpanzees, with a memorable scene of the man walking down a dirt road with the chimps. The movie is based on a book, released before 2010, and possibly a romantic comedy.\""}
{"query_id": "139", "query": "\"Color TV horror series from the 1970s or 1980s featuring a house that changes appearance after each death, possibly a haunted house that moves around, with a ghostly figure involved in the deaths.\""}
{"query_id": "875", "query": "\"Young high school musician loses hands in a car accident, receives mechanical hands, and returns to music with a mask, playing electronic music on a keyboard, released between 1986-1988\""}
{"query_id": "1050", "query": "Movie about a guy who moves to the UK or Ireland, joins a fighting group, sings a song before each fight, and dies from punches to the face, set around 8 years ago."}
{"query_id": "741", "query": "\"90s American family movie about a family with a young girl, middle boy, and oldest sister who seek help from a rapper to win a singing/rapping competition, finishing second, seen on TV in 2004.\""}
{"query_id": "996", "query": "\"Movie about teenagers who find and bury a dying bank robber with stolen money, leading to a decades-long secret that's threatened when the lake where they hid the car is drained, resulting in a violent confrontation, hostage situation, and shootout between the cop and authorities.\""}
{"query_id": "1007", "query": "\"Black and white, satirical Frankenstein-esque movie with regenerating monster creations, kidnapping young women, and dark humor, possibly from the 10s, with a Frankenstein scientist and a metal spiral machine, reminiscent of The Munsters or The Addams Family.\""}
{"query_id": "812", "query": "Girl lies about getting drunk by mixing red and white wine after prom, then reveals she was at prom with her real dad; possibly starring Julia Stiles, unsure of release date or format (movie/TV show, short film, web series)."}
{"query_id": "613", "query": "\"Intelligent serial killer in a late 2000s crime drama who continues to commit murders from prison, eventually meeting his demise via a bomb planted by a detective.\""}
{"query_id": "441", "query": "Man in swim trunks walks up hill in rain, passing tennis court, enters dark ransacked house, dramatic music, final scene of 90s English movie, possibly on a beach, credits roll as man kneels in defeat."}
{"query_id": "692", "query": "\"TV series set in Singapore, late 70's or early 80's, about an American private investigator with a local assistant, in a dark and humid atmosphere, with characters sweating frequently.\""}
{"query_id": "323", "query": "A young man searches for metallic plates with Phoenician-like symbols in a 70s sci-fi action movie, set on a beach, where he competes with others for the artifact, which is possibly of extraterrestrial origin. The movie ends with a fight on the beach, where the hero finds the artifact pieces after defeating his opponent, and then continues his search in a new location, with a tone similar to the Incredible Hulk TV series."}
{"query_id": "1042", "query": "\"French black and white movie from the 1960s, possibly by Truffaut, featuring a dream sequence where a boy runs down a street with a cane, steals a movie poster from a closed theater.\""}
{"query_id": "178", "query": "Gene Hackman being burned to death on a four-poster bed by a mob using a blowtorch in a film, possibly a thriller from the 70s or 80s, possibly directed by a well-known director, possibly a lesser-known film, possibly a made-for-TV movie, with a memorable death scene, possibly starring Gene Hackman."}
{"query_id": "355", "query": "\"A 2004 TV adaptation of a classic story, where a king finds a baby in the woods, and the princess, initially excited, later scolded for mistreating the baby. The princess and her adopted sister, with black hair, compete for the throne, with the adopted sister using magic. The princess seeks help from a childhood companion in the woods and navigates a love triangle with the prince, who is being manipulated by the adopted sister. The story features a climactic battle in the woods involving a scarecrow doll, and the princess must fight the prince for the future queen's hand.\""}
{"query_id": "768", "query": "American sci-fi action movie from around 10 years ago about soldiers fighting human-like robots on an island, featuring a man committing suicide after being impaled, a couple getting impaled by wooden spears, and a woman surviving to defeat a giant robot at the end."}
{"query_id": "144", "query": "Animated Christmas movie from the 90's featuring a boy and trains, with a scene of a boy being chased by a steam locomotive across a lake, and a dream sequence where the train appears at his door. The film has a darker tone and ends with the boy playing with a toy locomotive."}
{"query_id": "759", "query": "\"70's color sci-fi movie featuring a group of 6 people, one of whom has boomerang-like blade weapons. A wimpy group member gets injured by a blade tip moving up his arm and amputates it to save his life. The knives are used for combat and to open a cave-like entrance. The movie is set on Earth or an unspecified location.\""}
{"query_id": "401", "query": "\"English crime/thriller/action movie from a few years ago featuring a murder plot, a kid hitchhiking with a man driving a car with a porn-covered interior, and the man possibly being the killer or a major suspect.\""}
{"query_id": "688", "query": "A man makes a bet to spend a night in a haunted castle, aided by a female ghost, who ultimately kills him with a gate in a movie from the late 60s or early 70s."}
{"query_id": "125", "query": "A historical drama film or miniseries about a war between European settlers and Native Americans, set after 1980, featuring a white woman shot in the knee by an arrow, a woman mourning the loss of her baby, a woman and a man (of Asian and African American descent) being attacked by outlaws, and scenes of violence and death, including hangings. The story may involve themes of survival, captivity, and the treatment of slaves or servants. The film was likely broadcast on television in color. The plot may involve a woman considering shooting her child during a Native American attack. The film is a Western, released after"}
{"query_id": "292", "query": "\"Low-budget Sci-Fi movie about a deadly alien plant that grows rapidly, kills crew members, and can be killed by a specific person's blood. The plant is sensitive to light and camera flash triggers its growth. The movie is a made-for-TV film, likely from the Sci-Fi Channel.\""}
{"query_id": "116", "query": "\"Old black & white movie about a woman visiting a small, creepy town with a run-down church, an antique shop, and an inn with a trap door. The townspeople are mostly evil, except for the good preacher and his daughter, who owns the antique shop. The evil townspeople meet once a year. Released before the advent of color films, likely from the 1930s.\""}
{"query_id": "975", "query": "\"Animated 80s/90s VHS movie or show featuring two opposing groups in a home computer tower, with a power surge opening a portal for bad computer programs to escape to our world, where they transform into human items for transportation and continue their fight until the good guys round up all the bad ones and return them to the computer world.\""}
{"query_id": "629", "query": "\"1980s color TV movie or episode featuring a desert home in Arizona with a pyramid-shaped portal or door and UFOs flying through the house, possibly aired on KTLA channel 5 in the LA area.\""}
{"query_id": "751", "query": "English-speaking TV show from the same era as Power Rangers, featuring a boy, scientist, warrior girl, and glowing-haired troll traveling through dimensions in a ship to find crystals, with adventures including a damaged ship, a poisoned warrior girl, and a boy searching for a cure. Last episode involves combining crystals for transportation. The show also features a mushroom that's a living race, which poisons the warrior girl."}
{"query_id": "555", "query": "\"Color video of half-nude Arabian girl dancing with 5 seated musicians, 2 additional girls joining in and stripping, men clapping and forming a canopy to cover them, found on Dailymotion but now deleted, help identify the video title.\""}
{"query_id": "1093", "query": "\"Sci-fi movie from around 2012 on YouTube about a man becoming pregnant after exposure to a meteor-like object, giving birth to a multi-limbed creature, involving a court case about the rights of a non-human child. Low budget B-movie.\""}
{"query_id": "829", "query": "\"English black-and-white Christmas movie from the 1960s about an orphaned family of five children, where the oldest child tries to find homes for them before Christmas, possibly featuring snow and a child expressing fear with the phrase 'I'm afraid'.\""}
{"query_id": "952", "query": "\"80s thriller about a woman whose ex-husband, believed to be dead, kidnaps their children, hiding them in a house rented by a friend. The woman is suspected of killing their previous children. She finds the kids after receiving a glove belonging to her daughter. The movie features a climactic fight on a catwalk, ending with the ex-husband's death by falling. Set in New England, in color.\""}
{"query_id": "291", "query": "Movie from the past 10-15 years featuring a writer hiding thoughts in a library-like room within his subconscious, with a woman's help, where he runs around a circular room pushing files to lock doors and keep a bad guy out."}
{"query_id": "944", "query": "\"Older film about a family in a transient situation, possibly staying in a hotel or an unknown type of room, with a small child crying, where the mother considers smothering the child but ultimately decides against it.\""}
{"query_id": "805", "query": "\"Time-traveling alien with long or gray hair investigates medieval Europe, returning to ship for screen conversations, featuring grisly gore and a climax where the hero uses a futuristic weapon to avenge a loved one's death after the bad guy kills someone near them.\""}
{"query_id": "225", "query": "\"Horror film from late 90s or early 2000s about a woman being stalked on a subway by a white-haired man with a house featuring yellow, dirty walls and a jar of bloody tongues and pliers. The film includes a scene in a blue-lit room where the woman shares her experience with a man.\""}
{"query_id": "764", "query": "\"Fantasy TV series or movie from the late 1990s or early 2000s, similar to The 10th Kingdom, with a family from our world summoned by wizards from medieval China to a world with evil robots, including multi-wheeled armored vehicles with laser guns. The story features a betraying witch, a yellow car, a robot with mirror-like armor, and a girl who survives being shot and knocked unconscious. The witch uses a teleportation device resembling a small boat with a spinning center, and the heroes use a yellow car to escape. The story involves a battle with evil robots, including APCs with"}
{"query_id": "967", "query": "\"Movie from the late 80's to early 90's about a man who builds a plastic cage in his car and intentionally causes accidents to harm female passengers.\""}
{"query_id": "218", "query": "Post-apocalyptic movie set in a world with intense sunlight, featuring a bullied kickboxer boy, a girl love interest, and a scientist father who transforms into a plant monster. The boy and girl are immune to the sun. The movie is a B-quality film, likely released in the late 90s or early 2000s. The boy's boxing background is a key aspect of the plot, and his father's transformation is a result of trying to solve the sun problem. The movie does not include titles like \"Green\", \"Growth\", or \"Spore\"."}
{"query_id": "795", "query": "Female-led sci-fi live-action movie from around 2007 featuring a former human test subject on the run, with a scene where she is in a blue, bubble-shaped container filled with liquid, observed by a scientist in a white lab coat, and also has a nightmare about being in a similar container."}
{"query_id": "796", "query": "\"Blonde, short child searching for parents in a post-apocalyptic or sci-fi setting, with an antagonist that follows him, seen in an old movie or TV program.\""}
{"query_id": "669", "query": "\"Movie with a teenage daughter, boyfriend, and hostage situation in a family's home, featuring a gun misfire during a confrontation with a hostage-taker, and a scene where the boyfriend brings flowers to the door.\""}
{"query_id": "894", "query": "English 1990s suspense/thriller/romance/psycho film about a teenage girl studying fine arts, having an affair with her older married art instructor, featuring scenes of nudity, sex, and cello playing, likely shown on cable TV around 1996-1997. The film is colored and features the girl being painted nude by her instructor. The instructor's house is also featured in the movie, including a dinner party scene. The girl lives alone and has an Asian roommate who plays the cello. The film is set in the 1990s and is an English-language movie. The girl is a"}
{"query_id": "653", "query": "A children's movie featuring a woman in disguise who steals a jewel from an old man, with a ski trip and jacuzzi scene, where the old man hides with a fake tattoo that washes off in the jacuzzi."}
{"query_id": "986", "query": "\"1970s TV show/movie featuring a young couple returning to their old home, where they discover a possibly twin sister chained in the attic.\""}
{"query_id": "866", "query": "Late 80s/90s kids Halloween movie featuring a brother and sister duo, with a water mill running dry, where a boy makes a wish by skipping a rock three times, causing the mill to magically fill with water again. The movie was recorded on VHS and is remembered for its climax involving a wish-granting rock skip."}
{"query_id": "496", "query": "Science fiction/horror movie or TV show featuring a tall, gaunt undertaker character teleporting on an invisible grid in a bleak desert landscape, reminiscent of The Night Gallery or Twilight Zone."}
{"query_id": "394", "query": "\"Canadian drama film from the early 2000s with multiple intertwined stories, featuring a maid recovering from a traffic accident, a man falsely accused of stealing a watch, a man going through divorce, a father paying bail for his addict son, a student committing suicide, a man getting fired and rehired, and a colleague winning the lottery. The film has a cold and depressing atmosphere.\""}
{"query_id": "352", "query": "English language 90s film featuring a high school or college setting, a girl with short hair eating a dissected body part, causing a blonde snobby girl to vomit in a gross out moment."}
{"query_id": "604", "query": "A 1960s black-and-white film about a humanoid alien who befriends a woman in a small town, but their friendship is threatened by a creature hiding in a nearby cave. The alien tries to kill the creature using a damaged weapon, which he repairs by using power from town power lines, with the woman's help. The power company is contacted to switch off the power during the alien's attempt to kill the creature. What is the name of this film?"}
{"query_id": "601", "query": "Late 90s teen movie, likely released between 2001-2004, on VHS, in color, featuring an \"Average Joe\" character who falls for the popular girl. The plot includes a shower joke, reconciliation, and a pivotal prom invitation scene where the girl becomes fixated or drunk, leading to a confrontation. The opening credits feature scanning makeup and lipsticks. The movie is in English."}
{"query_id": "562", "query": "\"Accidental shooting of a young boy by his friend in a bedroom scene from a movie or TV show, leading to police questioning.\""}
{"query_id": "730", "query": "Sci-fi movie from late 1970s/early 1980s featuring a worm monster in a desert setting, with characters in astronaut gear, and a scene where a character is dragged screaming into the worm's hole. Not Dune."}
{"query_id": "600", "query": "90s movie with alien handshake scene where alien deceives human, leading to human's death, similar to Independence Day."}
{"query_id": "657", "query": "Sci-fi/fantasy film from the 80s about a modern family's magical adventure, featuring a mailbox with a mysterious object inside, a desert with bones, and a glass wall or invisible barrier. Uncommon movie."}
{"query_id": "956", "query": "\"90s English-language film about an awkward guy who orders rum and coke at a party, possibly involving a successful, engaged friend and a sexual encounter.\""}
{"query_id": "109", "query": "\"Old MGM movie from the 50s-60s in English, featuring a green alien in a bright green suit, whose body parts continue moving after being burned, causing a rain of zombie-infecting smoke over a cemetery, leading to a zombie outbreak and ultimately a government nuking of the town.\""}
{"query_id": "801", "query": "\"Horror movie from early to mid 2000s featuring a realtor who tells scary stories to scare off buyers, including tales of a family killed by a monkey, a killer wearing a grandma mask, and a therapist's death. The realtor ultimately kills one of the buyers and the neighborhood is revealed to be haunted, with the wife escaping a dangerous neighborhood.\""}
{"query_id": "495", "query": "\"Live-action fantasy series from late 80s to mid 90s with 6 films, featuring a protagonist collecting crystal shards, traveling to a town with a Raggedy Anne-like character, encountering alien races with conehead-like features, and possibly having a partner or group of helpers. The series may have started with the protagonist being brought aboard a spaceship from his room on a computer, and the second film features a terrarium setting with large hands reaching in. The third film's box may be bright pink, and the fourth film ends with a preview of a spaceship or subway train attacked by brown worm-like monsters. The series"}
{"query_id": "823", "query": "80s or 90s animated series or movie with a brunette main character resembling Barbie, featuring babysitting and mall visit episodes or scenes, possibly released on VHS."}
{"query_id": "1025", "query": "\"Old color movie with a party scene, followed by a shooting scene, and then desert travel. A young girl and boy survive, find water by digging in the sand, take refuge in a cave, and are either rescued or cross the desert.\""}
{"query_id": "445", "query": "\"Movie released between 2000 and 2010, titled 'Girl in a Coma' or possibly 'Frankie', set in Europe, featuring a brother and sister, with a dark color palette, plot involving a girl getting hit by a car, entering a coma, and her brother entering a coma to connect their brain waves to rescue her, and a scene where she falls through the ice on a pond at a cabin, aired on TV.\""}
{"query_id": "259", "query": "High school students, bullied, retaliate with party, torture victims, acid, and chemicals, featuring a scarred girl, black and white scenes, a main character in a trench coat and gas mask, a girl with a butterfly mask, a black character in a clown suit, and a quad chase scene."}
{"query_id": "330", "query": "\"Teenagers, possibly Sarah Michelle Gellar and Matthew Broderick, in a pre-internet setting, attempt to have sex or perform a handjob in a simply furnished room, with the boy referencing horses and the girl removing her bra, in a scene that circulated online as an animated GIF, possibly on imgur.com.\""}
{"query_id": "213", "query": "\"Goldsmith's female muse starves to resemble Christ in skinny crucifixes, a theme explored in a 2011 Netflix movie.\""}
{"query_id": "595", "query": "\"80s live-action movie about a family living underground, receiving colorful, slimy food through pipes, possibly mutated, set in a futuristic time period, with a title similar to 'Weird' or 'Freaky' something, released on Beta Max format, possibly a cult classic, seen in the 80's as a kid.\""}
{"query_id": "384", "query": "\"Thriller movie about a cult investigator (priest or police officer) searching for missing children in a suspicious town or village, featuring a child on a horse in a nightgown, dialogue about Satan's return, and a possible happy ending. Set in an English-speaking country, released around the late 90s to early 2000s, with a focus on a cult using supernatural powers and a child being dragged by a horse or found asleep/cut-off faces.\""}
{"query_id": "122", "query": "English-language movie from the 80s or 90s, featuring humans entering an underground cave and encountering small, white, human-faced creatures with green or red faces, and a plot twist involving a character's death by shooting on a bus. The movie was shown on Fox 5 in the 90s and has a similar plot to Willy Wonka and the Chocolate Factory. It was a horror, sci-fi, or fantasy movie, possibly in color. The creatures resemble oompa loompas. The movie was set in an underground cave and had an unexpected ending involving a fatal shooting on a bus."}
{"query_id": "828", "query": "Animated movie (2009-2015) on Netflix featuring silhouette characters, a boy and a girl in an old theater, an owl, and a costume-changing platform. The movie consists of multiple short stories, including wrongful imprisonment, a wolf curse, dragon-slaying, and a tunnel prison escape, with a focus on African drum playing and a princess's pity. The story also involves a boy wrongly accused of theft, an evil sister's plot, and a choice of bride with the help of a bee. The movie features a mix of fantastical and adventurous plots, with a nostalgic old-school animation style.  #animatedmovie"}
